simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/psoc_adc.c
#include "psoc_adc.h"

static volatile int32 g_psoc_adc_isr_counts = 0;
static volatile uint8 g_psoc_adc_isr_ready = 0u;

/* Config activa pedida por el host (ADC_CF_2V5 | ADC_CF_0V512 |
 * ADC_CF_1V024 | ADC_CF_0V625). */
static uint8 g_psoc_adc_config = ADC_CF_2V5;
/* Override de calibración: fuerza 2V5 sin perder la elección del usuario. */
static uint8 g_psoc_adc_cal_force_2v5 = 0u;
/* Factor de decimación con promedio (1 = sin decimar). */
static uint8 g_psoc_adc_decimation = 1u;

int32 psoc_adc_counts_right_aligned(int32 adc_counts)
{
    /* NORMALIZA LAS CUENTAS DE CUALQUIER CONFIGURACION A LA MISMA ESCALA.
     *
     * Antes esto miraba SOLO ADC_CF_2V5, porque era la unica configuracion
     * left-aligned con DEC_DIV distinto de cero. Esa suposicion estaba
     * horneada en el codigo y se rompe apenas alguien cambia el alineamiento
     * de otra configuracion desde el customizer, que es exactamente lo que
     * paso el 2026-09-05: al poner las cuatro a la izquierda, las otras tres
     * habrian quedado sin dividir, o sea mal por un factor de hasta 32, y
     * SIN QUE NADA LO AVISE. Las medidas habrian salido treinta veces mas
     * grandes y todo lo demas habria seguido compilando y corriendo.
     *
     * Ahora se usa el DEC_DIV de la configuracion ACTIVA, leido de los
     * defines que genera el propio customizer. Si manana se cambia cualquier
     * alineamiento, esto sigue estando bien sin tocar una linea.
     *
     * Se consulta ADC_Config -variable del componente, mantenida por
     * ADC_SelectConfiguration- y no g_psoc_adc_config, porque durante la
     * calibracion el override puede tener aplicada una config distinta de la
     * que el usuario pidio. */
    int32 div = 1;

    switch (ADC_Config) {
#if defined(ADC_CF_2V5) && (ADC_CF_2V5_DEC_DIV != 0)
        case ADC_CF_2V5:   div = (int32)ADC_CF_2V5_DEC_DIV;   break;
#endif
#if defined(ADC_CF_0V512) && (ADC_CF_0V512_DEC_DIV != 0)
        case ADC_CF_0V512: div = (int32)ADC_CF_0V512_DEC_DIV; break;
#endif
#if defined(ADC_CF_1V024) && (ADC_CF_1V024_DEC_DIV != 0)
        case ADC_CF_1V024: div = (int32)ADC_CF_1V024_DEC_DIV; break;
#endif
#if defined(ADC_CF_0V625) && (ADC_CF_0V625_DEC_DIV != 0)
        case ADC_CF_0V625: div = (int32)ADC_CF_0V625_DEC_DIV; break;
#endif
        default: div = 1; break;
    }

    if (div > 1) {
        adc_counts /= div;
    }
    return adc_counts;
}

uint8 psoc_adc_get_config(void)
{
    return g_psoc_adc_config;
}

uint8 psoc_adc_set_config(uint8 cfg)
{
    if ((cfg != ADC_CF_2V5) && (cfg != ADC_CF_0V512) &&
        (cfg != ADC_CF_1V024) && (cfg != ADC_CF_0V625)) {
        return 0u;
    }
    g_psoc_adc_config = cfg;
    return 1u;
}

uint8 psoc_adc_get_decimation(void)
{
    return g_psoc_adc_decimation;
}

uint8 psoc_adc_set_decimation(uint8 factor)
{
    if (factor == 0u || factor > PSOC_ADC_DECIMATION_MAX) {
        return 0u;
    }
    g_psoc_adc_decimation = factor;
    return 1u;
}

uint16 psoc_adc_effective_fs_hz(void)
{
    /* "Actual conv. rate" del customizer (las 4 configs regeneradas a
     * 2604 SPS nativos, ver ADC_CF_2V5_SRATE etc. en Generated_Source),
     * dividido por el factor de decimación con promedio aplicado en el
     * ISR de captura (main.c). */
    return (uint16)(PSOC_ADC_NATIVE_FS_HZ / (uint16)g_psoc_adc_decimation);
}

void psoc_adc_cal_override(uint8 force_2v5)
{
    g_psoc_adc_cal_force_2v5 = (force_2v5 != 0u) ? 1u : 0u;
}

void psoc_adc_select_calibration_config(void)
{
    psoc_adc_cal_override(1u);
    psoc_adc_select_capture_config();
}

void psoc_adc_clear_isr_sample(void)
{
    uint8 saved = CyEnterCriticalSection();
    g_psoc_adc_isr_ready = 0u;
    CyExitCriticalSection(saved);
}

void psoc_adc_note_isr_sample(int32 counts)
{
    g_psoc_adc_isr_counts = counts;
    g_psoc_adc_isr_ready = 1u;
}

uint8 psoc_adc_take_isr_sample(int32 *out_counts)
{
    uint8 ok = 0u;
    uint8 saved;
    if (out_counts == (int32 *)0) {
        return 0u;
    }
    saved = CyEnterCriticalSection();
    if (g_psoc_adc_isr_ready) {
        *out_counts = g_psoc_adc_isr_counts;
        g_psoc_adc_isr_ready = 0u;
        ok = 1u;
    }
    CyExitCriticalSection(saved);
    return ok;
}

void psoc_adc_select_capture_config(void)
{
    uint8 cfg = g_psoc_adc_cal_force_2v5 ? (uint8)ADC_CF_2V5 : g_psoc_adc_config;
    /* SelectConfiguration hace ADC_Stop + InitConfig + compensación GCOR y
     * deja ADC_Config actualizado; con restart=0 no arranca conversiones.
     * ADC_Start posterior solo hace Enable (initVar!=0) y no pisa la config. */
    ADC_SelectConfiguration(cfg, 0u);
    /* Nuestros DMA leen ADC_DEC_SAMP_PTR en orden low-mid-high. La config 2
     * generada usa coherencia LOW, que libera el registro en el primer byte y
     * puede mezclar muestras. Forzamos HIGH para que el byte llave sea el
     * último que lee el DMA, igual que en la config 1. */
    ADC_SetCoherency(ADC_DEC_SAMP_KEY_HIGH);
    ADC_Start();
    ADC_StopConvert();
}

static volatile int32 g_psoc_adc_isr_window_sum   = 0;
static volatile uint8 g_psoc_adc_isr_window_n      = 0u;
static volatile uint8 g_psoc_adc_isr_window_ready  = 0u;

void psoc_adc_clear_isr_window(void)
{
    uint8 saved = CyEnterCriticalSection();
    g_psoc_adc_isr_window_ready = 0u;
    CyExitCriticalSection(saved);
}

void psoc_adc_note_isr_window(int32 sum, uint8 n)
{
    g_psoc_adc_isr_window_sum = sum;
    g_psoc_adc_isr_window_n = n;
    g_psoc_adc_isr_window_ready = 1u;
}

uint8 psoc_adc_take_isr_window(int32 *out_sum, uint8 *out_n)
{
    uint8 ok = 0u;
    uint8 saved;
    if (out_sum == (int32 *)0 || out_n == (uint8 *)0) {
        return 0u;
    }
    saved = CyEnterCriticalSection();
    if (g_psoc_adc_isr_window_ready) {
        *out_sum = g_psoc_adc_isr_window_sum;
        *out_n = g_psoc_adc_isr_window_n;
        g_psoc_adc_isr_window_ready = 0u;
        ok = 1u;
    }
    CyExitCriticalSection(saved);
    return ok;
}

static volatile int32 g_psoc_adc_isr_block[PSOC_ADC_LOTE_SAMPLES];
static volatile uint8 g_psoc_adc_isr_block_n     = 0u;
static volatile uint8 g_psoc_adc_isr_block_ready = 0u;

void psoc_adc_clear_isr_block(void)
{
    uint8 saved = CyEnterCriticalSection();
    g_psoc_adc_isr_block_ready = 0u;
    CyExitCriticalSection(saved);
}

void psoc_adc_note_isr_block(const int32 *samples, uint8 n)
{
    uint8 i;
    uint8 count = (n > PSOC_ADC_LOTE_SAMPLES) ? (uint8)PSOC_ADC_LOTE_SAMPLES : n;
    for (i = 0u; i < count; i++) {
        g_psoc_adc_isr_block[i] = samples[i];
    }
    g_psoc_adc_isr_block_n = count;
    g_psoc_adc_isr_block_ready = 1u;
}

uint8 psoc_adc_take_isr_block(int32 *out_samples, uint8 *out_n, uint8 max_n)
{
    uint8 ok = 0u;
    uint8 saved;
    uint8 i;
    uint8 count;
    if (out_samples == (int32 *)0 || out_n == (uint8 *)0) {
        return 0u;
    }
    saved = CyEnterCriticalSection();
    if (g_psoc_adc_isr_block_ready) {
        count = (g_psoc_adc_isr_block_n > max_n) ? max_n : g_psoc_adc_isr_block_n;
        for (i = 0u; i < count; i++) {
            out_samples[i] = g_psoc_adc_isr_block[i];
        }
        *out_n = count;
        g_psoc_adc_isr_block_ready = 0u;
        ok = 1u;
    }
    CyExitCriticalSection(saved);
    return ok;
}

static volatile int32 g_psoc_adc_isr_filtered_counts = 0;
static volatile uint8 g_psoc_adc_isr_filtered_ready  = 0u;

void psoc_adc_clear_isr_filtered_sample(void)
{
    uint8 saved = CyEnterCriticalSection();
    g_psoc_adc_isr_filtered_ready = 0u;
    CyExitCriticalSection(saved);
}

void psoc_adc_note_isr_filtered_sample(int32 counts)
{
    g_psoc_adc_isr_filtered_counts = counts;
    g_psoc_adc_isr_filtered_ready = 1u;
}

uint8 psoc_adc_take_isr_filtered_sample(int32 *out_counts)
{
    uint8 ok = 0u;
    uint8 saved;
    if (out_counts == (int32 *)0) {
        return 0u;
    }
    saved = CyEnterCriticalSection();
    if (g_psoc_adc_isr_filtered_ready) {
        *out_counts = g_psoc_adc_isr_filtered_counts;
        g_psoc_adc_isr_filtered_ready = 0u;
        ok = 1u;
    }
    CyExitCriticalSection(saved);
    return ok;
}
